app/controllers/groups_controller.rb

  def index
   @group = Group.find(:all,:conditions => "user_id = #{current_user.id} ")
    if @group.blank?
---
SELECT * FROM "groups" WHERE (user_id = 1 )
SELECT * FROM "groups"

  def create
    @group = Group.new(params[:group])
	@user_group = GroupsUser.new

    @group.user_id = current_user.id
    if @group.save
	  @user_group.group_id = @group.id
	  @user_group.user_id = current_user.id
	  @user_group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at", "user_id", "description") VALUES('Kuester tauschen sich aus', '2010-08-09 13:54:22', '2010-08-09 13:54:22', 1, 'test')
INSERT INTO "groups_users" ("created_at", "updated_at", "group_id", "user_id") VALUES('2010-08-09 13:54:22', '2010-08-09 13:54:22', 1, 1)

  def edit
    @group = Group.find(:first, :conditions => "id = #{params[:id]}")
---
SELECT * FROM "groups" WHERE (id = 2) LIMIT 1

  def update
    @group = Group.find(:first, :conditions => "id = #{params[:id]}")
    if @group.update_attributes(params[:group])
---
SELECT * FROM "groups" WHERE (id = 2) LIMIT 1
UPDATE "groups" SET "updated_at" = '2010-08-09 13:57:21', "name" = 'Besserer Name', "description" = 'Bessere Beschreibung' WHERE "id" = 2

  def destroy
    @group = Group.find(:first, :conditions => "id = #{params[:id]}")
    @user_group = GroupsUser.find(:first,:conditions=>["group_id=? and user_id=?",params[:id],current_user.id])
	if @user_group.group.user_id == current_user.id
		@group.destroy
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)
SELECT * FROM "groups_users" WHERE (group_id='1' and user_id=1) LIMIT 1
DELETE FROM "groups" WHERE "id" = 1