app/controllers/microposts_controller.rb

  def create
    @micropost  = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("created_at", "updated_at", "user_id", "content") VALUES('2010-07-17 13:22:17', '2010-07-17 13:22:17', 1, 'sdf')

  def destroy
    @micropost.destroy
---
DELETE FROM "microposts" WHERE "id" = 307