app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "microposts" WHERE ("microposts".user_id = 101) ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "microposts" WHERE ("microposts".user_id = 101)

  def create
      redirect_to(root_path) unless current_user?(@user)
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "admin", "remember_token", "email") VALUES('Wolle der Tolle', 'e7b4a9cebcf0dd5f655cc40da1d2f6aa710b3d2e193da7da3060afcae4d8772a', 'eeeab8484a6c4dcfc27fb5ec2a37f54b51181a7771b6e3580b0266286d020f45', '2010-07-17 10:50:34', '2010-07-17 10:50:34', 'f', NULL, 'wolfgang@ihloff.de')

  def index
    @title = "All Users"
    @users = User.paginate(:page => params[:page])
---
SELECT * FROM "users" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "users"

  def update
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2010-07-16 12:00:06', "encrypted_password" = '57541815991bcb6cac0e09236aa88f060225462092b10612a5c586ab3bd8afc4', "salt" = '0ea2afb6a75c3b5427850edff62cacb6729d98acfc3e02b2bcabb245f376e7e4', "name" = 'Juergen Maier' WHERE "id" = 1

  def destroy
    # This should prevent users from deleteing themselves, the test is missing for this
    unless @user === User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "id" = 1
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 3)

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 8)